// app_timer.h

#pragma once


// =========================================================================================== IMPORT

#include <stdint.h>
#include "../engine.h"

// =========================================================================================== IMPORT


// =========================================================================================== TIMER

typedef struct app_timer
{
    double current_time;   // текущее время (сек)
    double delta_time;     // dt между кадрами

    uint64_t last_ticks;   // внутренний тик

    int initialized;

} app_timer;

// =========================================================================================== TIMER


// =========================================================================================== TIMER API

// первичная инициализация
void app_timer_init(void);

// обновление (вызывать каждый кадр)
void app_timer_update(void);

// получение текущего времени
double app_timer_get_time(void);

// получение dt
double app_timer_get_delta(void);

// =========================================================================================== TIMER API
