// main.c

// =========================================================================================== ОПИСАНИЕ ЗАДАЧИ

/*

Напишите код, скомпилируйте, отправьте на выполнение и пришлите скриншот экрана консольного выполнения и листинга кода.

Задание 1

Составьте программу, которая с помощью функций стандартных библиотек (stdlib.h, math.h, time.h и так далее) выделяет
память для динамического массива, размерность которого вводится с консоли, заполняет его гармоническим (синусоидальным) сигналом, 
добавляет к сигналу шумовую компоненту и выводит массив чисел этого сигнала.

Задание 2 (повышенной сложности, выполните по желанию)

Составьте программу, которая на основе предыдущей программы выведет график функции зашумлённого и чистого сигналов. 
Для построения графиков можно найти и подключить специализированную библиотеку или разработать собственный метод.

*/

// =========================================================================================== ОПИСАНИЕ ЗАДАЧИ


// =========================================================================================== IMPORT

// Загрузка приложения
#include "app.h"

// =========================================================================================== IMPORT


// =========================================================================================== MAIN

int main()
{
    return SDL_app_init_and_run();
}

// =========================================================================================== MAIN
